class CharsetInstance
  attr_reader :id, :chars

  def initialize(id, chars)
    raise ArgumentError.new('charset must contain 256 characters') if chars.length != 256

    @id = id
    @chars = chars
  end

  def from_byte(byte)
    raise ArgumentError.new("byte `#{byte}` is out of range") if byte < 0 || byte > 255

    @chars[byte]
  end

  def from_word(word)
    word = word.from_rev_hex if word.is_a?(String)
    bytes = [
      (word >> 0x00) & 0xFF,
      (word >> 0x08) & 0xFF,
      (word >> 0x10) & 0xFF,
      (word >> 0x18) & 0xFF,
    ]

    bytes.map { |byte| self.translate_byte(byte) }
  end

  def from_str(str)
    str.split('').flat_map { |char| self.chars.find_index(char)&.to_le(2) }
  end

  def from_str_le(str_le)
    str_le.split_group(2).map(&:from_hex).map { |idx| self.chars[idx] }
  end
end

module Charset
  ALL = [
    JP = CharsetInstance.new(0x01, [
      '　', 'あ', 'い', 'う', 'え', 'お', 'か', 'き', 'く', 'け', 'こ', 'さ', 'し', 'す', 'せ', 'そ',
      'た', 'ち', 'つ', 'て', 'と', 'な', 'に', 'ぬ', 'ね', 'の', 'は', 'ひ', 'ふ', 'へ', 'ほ', 'ま',
      'み', 'む', 'め', 'も', 'や', 'ゆ', 'よ', 'ら', 'り', 'る', 'れ', 'ろ', 'わ', 'を', 'ん', 'ぁ',
      'ぃ', 'ぅ', 'ぇ', 'ぉ', 'ゃ', 'ゅ', 'ょ', 'が', 'ぎ', 'ぐ', 'げ', 'ご', 'ざ', 'じ', 'ず', 'ぜ',
      'ぞ', 'だ', 'ぢ', 'づ', 'で', 'ど', 'ば', 'び', 'ぶ', 'べ', 'ぼ', 'ぱ', 'ぴ', 'ぷ', 'ぺ', 'ぽ',
      'っ', 'ア', 'イ', 'ウ', 'エ', 'オ', 'カ', 'キ', 'ク', 'ケ', 'コ', 'サ', 'シ', 'ス', 'セ', 'ソ',
      'タ', 'チ', 'ツ', 'テ', 'ト', 'ナ', 'ニ', 'ヌ', 'ネ', 'ノ', 'ハ', 'ヒ', 'フ', 'ヘ', 'ホ', 'マ',
      'ミ', 'ム', 'メ', 'モ', 'ヤ', 'ユ', 'ヨ', 'ラ', 'リ', 'ル', 'レ', 'ロ', 'ワ', 'ヲ', 'ン', 'ァ',
      'ィ', 'ゥ', 'ェ', 'ォ', 'ャ', 'ュ', 'ョ', 'ガ', 'ギ', 'グ', 'ゲ', 'ゴ', 'ザ', 'ジ', 'ズ', 'ゼ',
      'ゾ', 'ダ', 'ヂ', 'ヅ', 'デ', 'ド', 'バ', 'ビ', 'ブ', 'ベ', 'ボ', 'パ', 'ピ', 'プ', 'ペ', 'ポ',
      'ッ', '０', '１', '２', '３', '４', '５', '６', '７', '８', '９', '！', '？', '。', 'ー', '・',
      '…', '『', '』', '「', '」', '♂', '♀', '円', '．', '×', '／', 'Ａ', 'Ｂ', 'Ｃ', 'Ｄ', 'Ｅ',
      'Ｆ', 'Ｇ', 'Ｈ', 'Ｉ', 'Ｊ', 'Ｋ', 'Ｌ', 'Ｍ', 'Ｎ', 'Ｏ', 'Ｐ', 'Ｑ', 'Ｒ', 'Ｓ', 'Ｔ', 'Ｕ',
      'Ｖ', 'Ｗ', 'Ｘ', 'Ｙ', 'Ｚ', 'ａ', 'ｂ', 'ｃ', 'ｄ', 'ｅ', 'ｆ', 'ｇ', 'ｈ', 'ｉ', 'ｊ', 'ｋ',
      'ｌ', 'ｍ', 'ｎ', 'ｏ', 'ｐ', 'ｑ', 'ｒ', 'ｓ', 'ｔ', 'ｕ', 'ｖ', 'ｗ', 'ｘ', 'ｙ', 'ｚ', '►',
      '：', 'Ä', 'Ö', 'Ü', 'ä', 'ö', 'ü', '█', '█', '█', '█', '█', '█', '█', '█', '█',
    ]).freeze,

    EN = CharsetInstance.new(0x02, [
      ' ', 'À', 'Á', 'Â', 'Ç', 'È', 'É', 'Ê', 'Ë', 'Ì', '_', 'Î', 'Ï', 'Ò', 'Ó', 'Ô',
      'Œ', 'Ù', 'Ú', 'Û', 'Ñ', 'ß', 'à', 'á', '_', 'ç', 'è', 'é', 'ê', 'ë', 'ì', '_',
      'î', 'ï', 'ò', 'ó', 'ô', 'œ', 'ù', 'ú', 'û', 'ñ', 'º', 'ª', '_', '&', '+', '_',
      '_', '_', '_', '_', '◌', '=', ';', '_', '_', '_', '_', '_', '_', '_', '_', '_',
      '_', '_', '_', '_', '_', '_', '_', '_', '_', '_', '_', '_', '_', '_', '_', '_',
      "▯", "¿", "¡", "◌", "◌", "◌", "◌", "◌", "◌", "◌", "Í", "%", "(", ")", " ", " ",
      '_', '_', '_', '_', '_', '_', '_', '_', 'â', '_', '_', '_', '_', '_', '_', 'í',
      '_', '_', '_', '_', '_', '_', '_', '_', '_', '⬆', '⬇', '⬅', '➡', '*', '*', '*',
      '*', '*', '*', '*', 'ᵉ', '<', '>', '_', '_', '_', '_', '_', '_', '_', '_', '_',
      '_', '_', '_', '_', '_', '_', '_', '_', '_', '_', '_', '_', '_', '_', '_', '_',
      '◌', '0', '1', '2', '3', '4', '5', '6', '7', '8', '9', '!', '?', '.', '-', '･',
      '…', '“', '”', '‘', '’', '♂', '♀', '_', ',', '×', '/', 'A', 'B', 'C', 'D', 'E',
      'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U',
      'V', 'W', 'X', 'Y', 'Z', 'a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k',
      'l', 'm', 'n', 'o', 'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z', '►',
      ':', 'Ä', 'Ö', 'Ü', 'ä', 'ö', 'ü', '█', '█', '█', '█', '█', '█', '█', '█', '█',
    ]).freeze,
  ].freeze
end
